/* Задание 1. Ввести количество гостей и площадь номера.Данные должны быть положительными.
Номер считается допустимым для проживания, если на одного гостя приходится не меньше 8 квадратных метров. 
Если гостей больше 4, дополнительно требуется площадь не меньше 45 квадратных метров. Вывести, подходит номер или нет, и объяснить причину.*/
#include <iostream>
using namespace std;

int main() {
	setlocale(LC_ALL, "Russian");
	int guests;
	double area;
	cout << "Введите площадь и количество гостей:";
	cin >> area >> guests;
	if (area <= 0 || guests <= 0) {
		cout << "Количество гостей и площадь не могут быть отрицательными." << endl;
	}
		int ga = guests * 8;
		if (ga > area) {
			cout << "Номер не подходит для заселения гостей.";
		}
		else if (guests > 4 && area <= 45) {
			cout << "Номер не подходит для проживания,т.к. при количестве гостей больше 4 площадь номера должна быть не менее чем 45 метров квадратных.";
		}

	else {
		cout << "Номер подходит для проживания гостей.";
	}
	return 0;
}